HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent = {
        .eEventType = eNetworkRxEvent,
        .pvData = ( void * ) pxDescriptor
    };
    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor, uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;
    do
    {
        if( pxDescriptor == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Null Descriptor\n" ) );
            break;
        }

        if( usLength > pxDescriptor->xDataLength )
		{
			iptraceETHERNET_RX_EVENT_LOST();
			FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
			break;
		}

        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        uint32_t ulErrorCode = 0;
        ( void ) HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode );
        if( ulErrorCode != 0 )
        {
			#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )
        		prvHAL_RX_ErrorCallback( pxEthHandle );
			#endif
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx Data Error\n" ) );
            break;
        }

        const ETH_DMADescTypeDef * const ulRxDesc = ( const ETH_DMADescTypeDef * const ) pxEthHandle->RxDescList.RxDesc[ pxEthHandle->RxDescList.RxDescIdx ];

        const uint32_t ulRxDesc1 = ulRxDesc->DESC1;
        /* if( READ_BIT( ulRxDesc1 , ETH_CHECKSUM_IP_PAYLOAD_ERROR ) != RESET )
		if( READ_BIT( ulRxDesc1 , ETH_CHECKSUM_BYPASSED ) != RESET )
		if( READ_BIT( ulRxDesc1 , ETH_CHECKSUM_IP_HEADER_ERROR ) != RESET ) */

		if( READ_BIT( ulRxDesc1, ETH_IP_HEADER_IPV4 ) != RESET )
        {
            #if ipconfigIS_DISABLED( ipconfigUSE_IPv4 )
				iptraceETHERNET_RX_EVENT_LOST();
               break;
            #else
               /* prvAllowIPPacketIPv4(); */
            #endif
        }
		else if( READ_BIT( ulRxDesc1, ETH_IP_HEADER_IPV6 ) != RESET )
        {
            #if ipconfigIS_DISABLED( ipconfigUSE_IPv6 )
				iptraceETHERNET_RX_EVENT_LOST();
				break;
            #else
                /* prvAllowIPPacketIPv6(); */
            #endif
        }

        /* if( READ_BIT( ulRxDesc1, ETH_DMARXNDESCWBF_PT ) == ETH_IP_PAYLOAD_UDP )
        {
            prvProcessUDPPacket();
        } */
        if( READ_BIT( ulRxDesc1, ETH_DMARXNDESCWBF_PT ) == ETH_IP_PAYLOAD_ICMPN )
        {
			#if ipconfigIS_DISABLED( ipconfigREPLY_TO_INCOMING_PINGS ) && ipconfigIS_DISABLED( ipconfigSUPPORT_OUTGOING_PINGS )
        		iptraceETHERNET_RX_EVENT_LOST();
        		break;
			#else
        		/* ProcessICMPPacket(); */
			#endif
        }
		if( READ_BIT( ulRxDesc1, ETH_DMARXNDESCWBF_PT ) == ETH_IP_PAYLOAD_UNKNOWN )
        {
			iptraceETHERNET_RX_EVENT_LOST();
            break;
        }
		if( READ_BIT( ulRxDesc1, ETH_DMARXNDESCWBF_PT ) == ETH_IP_PAYLOAD_TCP )
        {
            #if ipconfigIS_DISABLED( ipconfigUSE_TCP )
				iptraceETHERNET_RX_EVENT_LOST();
                break;
            #else
                /* xProcessReceivedTCPPacket() */
            #endif
        }

        /* const uint32_t ulRxDesc2 = ulRxDesc->DESC2;
		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_L3L4FM ) != RESET )
		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_L4FM ) != RESET )
		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_L3FM ) != RESET )

		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_MADRM ) != RESET )

		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_HF ) != RESET )
		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_DAF ) != RESET )
		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_SAF ) != RESET )
		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_VF ) != RESET )

		if( READ_BIT( ulRxDesc2, ETH_DMARXNDESCWBF_ARPNR ) != RESET ) */

        /* const uint32_t ulRxDesc3 = ulRxDesc->DESC3; */
        /* #if ipconfigIS_ENABLED( niEMAC_ARP_OFFLOAD )
            if( READ_BIT( ulRxDesc3, ETH_DMARXNDESCWBF_LT ) == ETH_DMARXNDESCWBF_LT_ARP )
            {
                const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pxDescriptor->pucEthernetBuffer;
                const IPHeader_t * const pxIPHeader = &( pxIPPacket->xIPHeader );
                const uint32_t ulSourceIPAddress = pxIPHeader->ulSourceIPAddress;
                HAL_ETHEx_DisableARPOffload( pxEthHandle );
                HAL_ETHEx_SetARPAddressMatch( pxEthHandle, ulSourceIPAddress );
                HAL_ETHEx_EnableARPOffload( pxEthHandle );
            }
        #endif */
		/* if( READ_BIT( ulRxDesc3, ETH_DMARXNDESCWBF_RS2V ) != RESET )
		if( READ_BIT( ulRxDesc3, ETH_DMARXNDESCWBF_RS1V ) != RESET )
		if( READ_BIT( ulRxDesc3, ETH_DMARXNDESCWBF_RS0V ) != RESET )

		if( READ_BIT( ulRxDesc3, ETH_DMARXNDESCWBF_ES ) != RESET ) */

        /* TODO: Should we do this even if it is handled in hardware too? */
        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
            	iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                break;
            }
        #endif

        /* TODO: Create a eConsiderPacketForProcessing */
        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
            if( eConsiderPacketForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
            	iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        #endif

        xResult = pdTRUE;

    } while( pdFALSE );

    return xResult;
}

