HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

void HAL_ETH_TxFreeCallback( uint32_t * pulBuff )
{
    NetworkBufferDescriptor_t * const pxNetworkBuffer = ( NetworkBufferDescriptor_t * ) pulBuff;
    prvReleaseNetworkBufferDescriptor( pxNetworkBuffer );
    ( void ) xSemaphoreGive( xTxDescSem );
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           Buffer Allocation                               */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void vNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    static uint8_t ucNetworkPackets[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ niEMAC_TOTAL_BUFFER_SIZE ] __ALIGNED( niEMAC_BUF_ALIGNMENT ) __attribute__( ( section( niEMAC_BUFFERS_SECTION ) ) );

    configASSERT( xBufferAllocFixedSize == pdTRUE );

    size_t uxIndex;
    for( uxIndex = 0; uxIndex < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; ++uxIndex )
    {
        pxNetworkBuffers[ uxIndex ].pucEthernetBuffer = &( ucNetworkPackets[ uxIndex ][ ipBUFFER_PADDING ] );
        *( ( uint32_t * ) &( ucNetworkPackets[ uxIndex ][ 0 ] ) ) = ( uint32_t ) ( &( pxNetworkBuffers[ uxIndex ] ) );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Network Interface Definition                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface )
{
    static char pcName[ 17 ];

    ( void ) snprintf( pcName, sizeof( pcName ), "eth%u", ( unsigned ) xEMACIndex );

    ( void ) memset( pxInterface, '\0', sizeof( *pxInterface ) );
    pxInterface->pcName = pcName;
    /* TODO: use pvArgument to get xEMACData? */
    /* xEMACData.xEMACIndex = xEMACIndex; */
    /* pxInterface->pvArgument = ( void * ) &xEMACData; */
    /* pxInterface->pvArgument = pvPortMalloc( sizeof( EMACData_t ) ); */
    pxInterface->pvArgument = ( void * ) xEMACIndex;
    pxInterface->pfInitialise = prvNetworkInterfaceInitialise;
    pxInterface->pfOutput = prvNetworkInterfaceOutput;
    pxInterface->pfGetPhyLinkStatus = prvGetPhyLinkStatus;
    /* pxInterface->pfAddAllowedMAC = prvAddAllowedMACAddress;
    pxInterface->pfRemoveAllowedMAC = prvRemoveAllowedMACAddress; */

    return FreeRTOS_AddNetworkInterface( pxInterface );
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigIPv4_BACKWARD_COMPATIBLE )

/* Do not call the following function directly. It is there for downward compatibility.
 * The function FreeRTOS_IPInit() will call it to initialice the interface and end-point
 * objects.  See the description in FreeRTOS_Routing.h. */
    NetworkInterface_t * pxFillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface )
    {
        pxSTM32_FillInterfaceDescriptor( xEMACIndex, pxInterface );
    }

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      		Debugging                         			 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/



#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )

static void prvHAL_RX_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
	uint32_t ulErrorCode = 0;
	( void ) HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode );
    if( ( ulErrorCode & ETH_DRIBBLE_BIT_ERROR ) != 0 )
    {
    	static size_t uxRxDBError = 0;
    	++uxRxDBError;
    }
    if( ( ulErrorCode & ETH_RECEIVE_ERROR ) != 0 )
    {
    	static size_t uxRxRcvError = 0;
		++uxRxRcvError;
    }
    if( ( ulErrorCode & ETH_RECEIVE_OVERFLOW ) != 0 )
    {
    	static size_t uxRxROError = 0;
		++uxRxROError;
    }
    if( ( ulErrorCode & ETH_WATCHDOG_TIMEOUT ) != 0 )
    {
    	static size_t uxRxWDTError = 0;
		++uxRxWDTError;
    }
    if( ( ulErrorCode & ETH_GIANT_PACKET ) != 0 )
    {
    	static size_t uxRxGPError = 0;
		++uxRxGPError;
    }
    if( ( ulErrorCode & ETH_CRC_ERROR ) != 0 )
    {
    	static size_t uxRxCRCError = 0;
		++uxRxCRCError;
    }
}

/*---------------------------------------------------------------------------*/

static void prvHAL_DMA_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );
	/* if( ( ulDmaError & ETH_DMA_RX_NO_ERROR_FLAG ) != 0 )
	{

	} */
	if( ( ulDmaError & ETH_DMA_RX_DESC_READ_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaRDRError = 0;
		++uxDmaRDRError;
	}
	if( ( ulDmaError & ETH_DMA_RX_DESC_WRITE_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaRDWError = 0;
		++uxDmaRDWError;
	}
	if( ( ulDmaError & ETH_DMA_RX_BUFFER_READ_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaRBRError = 0;
		++uxDmaRBRError;
	}
	if( ( ulDmaError & ETH_DMA_RX_BUFFER_WRITE_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaRBWError = 0;
		++uxDmaRBWError;
	}
	/* if( ( ulDmaError & ETH_DMA_TX_NO_ERROR_FLAG ) != 0 )
	{

	} */
	if( ( ulDmaError & ETH_DMA_TX_DESC_READ_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaTDRError = 0;
		++uxDmaTDRError;
	}
	if( ( ulDmaError & ETH_DMA_TX_DESC_WRITE_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaTDWError = 0;
		++uxDmaTDWError;
	}
	if( ( ulDmaError & ETH_DMA_TX_BUFFER_READ_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaTBRError = 0;
		++uxDmaTBRError;
	}
	if( ( ulDmaError & ETH_DMA_TX_BUFFER_WRITE_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaTBWError = 0;
		++uxDmaTBWError;
	}
	if( ( ulDmaError & ETH_DMA_CONTEXT_DESC_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaCDError = 0;
		++uxDmaCDError;
	}
	if( ( ulDmaError & ETH_DMA_FATAL_BUS_ERROR_FLAG ) != 0 )
	{
		static size_t uxDmaFBEError = 0;
		++uxDmaFBEError;
	}
	if( ( ulDmaError & ETH_DMA_EARLY_TX_IT_FLAG ) != 0 )
	{
		static size_t uxDmaETIError = 0;
		++uxDmaETIError;
	}
	if( ( ulDmaError & ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG ) != 0 )
	{
		static size_t uxDmaRWTError = 0;
		++uxDmaRWTError;
	}
	if( ( ulDmaError & ETH_DMA_RX_PROCESS_STOPPED_FLAG ) != 0 )
	{
		static size_t uxDmaRPSError = 0;
		++uxDmaRPSError;
	}
	if( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
	{
		static size_t uxDmaRBUError = 0;
		++uxDmaRBUError;
	}
	if( ( ulDmaError & ETH_DMA_TX_PROCESS_STOPPED_FLAG ) != 0 )
	{
		static size_t uxDmaTPSError = 0;
		++uxDmaTPSError;
	}
}

